def hotel_best_deal(city: str = None) -> dict:
    """
    Telegram: /bestdeal
    ф-ция поиска отелей по заданным условиям в городе
    условия
    ● Диапазон цен.
    ● Диапазон расстояния, на котором находится отель от центра.
    ● Количество отелей, которые необходимо вывести в результате

    вывод информации в bot
    ● название отеля,
    ● адрес,
    ● как далеко расположен от центра,
    ● цена,
    ● N фотографий отеля (если пользователь счёл необходимым их вывод)

    :param city: Название города
    :return: dict Список отелей
    """

    pass